## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 7 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                            |
|--------|------------------------------------------------------------|
| update | `aws_eks_addon.coredns`                                    |
|        | `aws_eks_addon.kube_proxy`                                 |
|        | `aws_eks_addon.vpc_cni`                                    |
|        | `aws_eks_cluster.notification-canada-ca-eks-cluster`       |
|        | `aws_eks_node_group.notification-canada-ca-eks-node-group` |
|        | `aws_iam_openid_connect_provider.notification-canada-ca`   |
|        | `aws_iam_role.notification-service-account-role`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.eks-assume-role-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks-assume-role-policy"  {
      ~ id      = "2728957943" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub = "system:serviceaccount:notification-canada-ca:notification-service-account"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # data.aws_security_group.eks-securitygroup-rds will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_group" "eks-securitygroup-rds"  {
      ~ arn         = "arn:aws:ec2:ca-central-1:239043911459:security-group/sg-0e2c3ef6c5c75b74c" -> (known after apply)
      ~ description = "EKS created security group applied to ENI that is attached to EKS Control Plane master nodes, as well as any managed workloads." -> (known after apply)
        id          = "sg-0e2c3ef6c5c75b74c"
      ~ name        = "eks-cluster-sg-notification-canada-ca-staging-eks-cluster-1914876598" -> (known after apply)
      ~ tags        = {
          - "Name"                                                             = "eks-cluster-sg-notification-canada-ca-staging-eks-cluster-1914876598"
          - "kubernetes.io/cluster/notification-canada-ca-staging-eks-cluster" = "owned"
        } -> (known after apply)
      ~ vpc_id      = "vpc-097508d1f5e243195" -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.tls_certificate.notification-canada-ca will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "notification-canada-ca"  {
      ~ certificates = [
          - {
              - cert_pem             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIEdTCCA12gAwIBAgIJAKcOSkw0grd/MA0GCSqGSIb3DQEBCwUAMGgxCzAJBgNV
                    BAYTAlVTMSUwIwYDVQQKExxTdGFyZmllbGQgVGVjaG5vbG9naWVzLCBJbmMuMTIw
                    MAYDVQQLEylTdGFyZmllbGQgQ2xhc3MgMiBDZXJ0aWZpY2F0aW9uIEF1dGhvcml0
                    eTAeFw0wOTA5MDIwMDAwMDBaFw0zNDA2MjgxNzM5MTZaMIGYMQswCQYDVQQGEwJV
                    UzEQMA4GA1UECBMHQXJpem9uYTETMBEGA1UEBxMKU2NvdHRzZGFsZTElMCMGA1UE
                    ChMcU3RhcmZpZWxkIFRlY2hub2xvZ2llcywgSW5jLjE7MDkGA1UEAxMyU3RhcmZp
                    ZWxkIFNlcnZpY2VzIFJvb3QgQ2VydGlmaWNhdGUgQXV0aG9yaXR5IC0gRzIwggEi
                    MA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDVDDrEKvlO4vW+GZdfjohTsR8/
                    y8+fIBNtKTrID30892t2OGPZNmCom15cAICyL1l/9of5JUOG52kbUpqQ4XHj2C0N
                    Tm/2yEnZtvMaVq4rtnQU68/7JuMauh2WLmo7WJSJR1b/JaCTcFOD2oR0FMNnngRo
                    Ot+OQFodSk7PQ5E751bWAHDLUu57fa4657wx+UX2wmDPE1kCK4DMNEffud6QZW0C
                    zyyRpqbn3oUYSXxmTqM6bam17jQuug0DuDPfR+uxa40l2ZvOgdFFRjKWcIfeAg5J
                    Q4W2bHO7ZOphQazJ1FTfhy/HIrImzJ9ZVGif/L4qL8RVHHVAYBeFAlU5i38FAgMB
                    AAGjgfAwge0wDwYDVR0TAQH/BAUwAwEB/zAOBgNVHQ8BAf8EBAMCAYYwHQYDVR0O
                    BBYEFJxfAN+qAdcwKziIorhtSpzyEZGDMB8GA1UdIwQYMBaAFL9ft9HO3R+G9FtV
                    rNzXEMIOqYjnME8GCCsGAQUFBwEBBEMwQTAcBggrBgEFBQcwAYYQaHR0cDovL28u
                    c3MyLnVzLzAhBggrBgEFBQcwAoYVaHR0cDovL3guc3MyLnVzL3guY2VyMCYGA1Ud
                    HwQfMB0wG6AZoBeGFWh0dHA6Ly9zLnNzMi51cy9yLmNybDARBgNVHSAECjAIMAYG
                    BFUdIAAwDQYJKoZIhvcNAQELBQADggEBACMd44pXyn3pF3lM8R5V/cxTbj5HD9/G
                    VfKyBDbtgB9TxF00KGu+x1X8Z+rLP3+QsjPNG1gQggL4+C/1E2DUBc7xgQjB3ad1
                    l08YuW3e95ORCLp+QCztweq7dp4zBncdDQh/U90bZKuCJ/Fp1U1ervShw3WnWEQt
                    8jxwmKy6abaVd38PMV4s/KCHOkdp8Hlf9BRUpJVeEXgSYCfOn8J3/yNTd126/+pZ
                    59vPr5KW7ySaNRB6nJHGDn2Z9j8Z3/VyVOEVqQdZe4O/Ui5GjLIAZHYcSNPYeehu
                    VsyuLAOQ1xk4meTKCRlb/weWsKh/NEnfVqn3sF/tM+2MR7cwA130A4w=
                    -----END CERTIFICATE-----
                EOT
              - is_ca                = true
              - issuer               = "OU=Starfield Class 2 Certification Authority,O=Starfield Technologies\\, Inc.,C=US"
              - not_after            = "2034-06-28T17:39:16Z"
              - not_before           = "2009-09-02T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "12037640545166866303"
              - sha1_fingerprint     = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - version              = 3
            },
          - {
              - cert_pem             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIEkjCCA3qgAwIBAgITBn+USionzfP6wq4rAfkI7rnExjANBgkqhkiG9w0BAQsF
                    ADCBmDELMAkGA1UEBhMCVVMxEDAOBgNVBAgTB0FyaXpvbmExEzARBgNVBAcTClNj
                    b3R0c2RhbGUxJTAjBgNVBAoTHFN0YXJmaWVsZCBUZWNobm9sb2dpZXMsIEluYy4x
                    OzA5BgNVBAMTMlN0YXJmaWVsZCBTZXJ2aWNlcyBSb290IENlcnRpZmljYXRlIEF1
                    dGhvcml0eSAtIEcyMB4XDTE1MDUyNTEyMDAwMFoXDTM3MTIzMTAxMDAwMFowOTEL
                    MAkGA1UEBhMCVVMxDzANBgNVBAoTBkFtYXpvbjEZMBcGA1UEAxMQQW1hem9uIFJv
                    b3QgQ0EgMTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALJ4gHHKeNXj
                    ca9HgFB0fW7Y14h29Jlo91ghYPl0hAEvrAIthtOgQ3pOsqTQNroBvo3bSMgHFzZM
                    9O6II8c+6zf1tRn4SWiw3te5djgdYZ6k/oI2peVKVuRF4fn9tBb6dNqcmzU5L/qw
                    IFAGbHrQgLKm+a/sRxmPUDgH3KKHOVj4utWp+UhnMJbulHheb4mjUcAwhmahRWa6
                    VOujw5H5SNz/0egwLX0tdHA114gk957EWW67c4cX8jJGKLhD+rcdqsq08p8kDi1L
                    93FcXmn/6pUCyziKrlA4b9v7LWIbxcceVOF34GfID5yHI9Y/QCB/IIDEgEw+OyQm
                    jgSubJrIqg0CAwEAAaOCATEwggEtMA8GA1UdEwEB/wQFMAMBAf8wDgYDVR0PAQH/
                    BAQDAgGGMB0GA1UdDgQWBBSEGMyFNOy8DJSULghZnMeyEE4KCDAfBgNVHSMEGDAW
                    gBScXwDfqgHXMCs4iKK4bUqc8hGRgzB4BggrBgEFBQcBAQRsMGowLgYIKwYBBQUH
                    MAGGImh0dHA6Ly9vY3NwLnJvb3RnMi5hbWF6b250cnVzdC5jb20wOAYIKwYBBQUH
                    MAKGLGh0dHA6Ly9jcnQucm9vdGcyLmFtYXpvbnRydXN0LmNvbS9yb290ZzIuY2Vy
                    MD0GA1UdHwQ2MDQwMqAwoC6GLGh0dHA6Ly9jcmwucm9vdGcyLmFtYXpvbnRydXN0
                    LmNvbS9yb290ZzIuY3JsMBEGA1UdIAQKMAgwBgYEVR0gADANBgkqhkiG9w0BAQsF
                    AAOCAQEAYjdCXLwQtT6LLOkMm2xF4gcAevnFWAu5CIw+7bMlPLVvUOTNNWqnkzSW
                    MiGpSESrnO09tKpzbeR/FoCJbM8oAxiDR3mjEH4wW6w7sGDgd9QIpuEdfF7Au/ma
                    eyKdpwAJfqxGF4PcnCZXmTA5YpaP7dreqsXMGz7KQ2hsVxa81Q4gLv7/wmpdLqBK
                    bRRYh5TmOTFffHPLkIhqhBGWJ6bt2YFGpn6jcgAKUj6DiAdjd4lpFw85hdKrCEVN
                    0FE6/V1dN2RMfjCyVSRCnTawXZwXgWHxyvkQAiSr6w10kY17RSlQOYiypok1JR4U
                    akcjMS9cmvqtmg5iUaQqqcT5NJ0hGA==
                    -----END CERTIFICATE-----
                EOT
              - is_ca                = true
              - issuer               = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - not_after            = "2037-12-31T01:00:00Z"
              - not_before           = "2015-05-25T12:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "144918191876577076464031512351042010504348870"
              - sha1_fingerprint     = "06b25927c42a721631c1efd9431e648fa62e1e39"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - cert_pem             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIEXjCCA0agAwIBAgITB3MSOAudZoijOx7Zv5zNpo4ODzANBgkqhkiG9w0BAQsF
                    ADA5MQswCQYDVQQGEwJVUzEPMA0GA1UEChMGQW1hem9uMRkwFwYDVQQDExBBbWF6
                    b24gUm9vdCBDQSAxMB4XDTIyMDgyMzIyMjEyOFoXDTMwMDgyMzIyMjEyOFowPDEL
                    MAkGA1UEBhMCVVMxDzANBgNVBAoTBkFtYXpvbjEcMBoGA1UEAxMTQW1hem9uIFJT
                    QSAyMDQ4IE0wMTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAOtxLKnL
                    H4gokjIwr4pXD3i3NyWVVYesZ1yX0yLI2qIUZ2t88Gfa4gMqs1YSXca1R/lnCKeT
                    epWSGA+0+fkQNpp/L4C2T7oTTsddUx7g3ZYzByDTlrwS5HRQQqEFE3O1T5tEJP4t
                    f+28IoXsNiEzl3UGzicYgtzj2cWCB41eJgEmJmcf2T8TzzK6a614ZPyq/w4CPAff
                    nAV4coz96nW3AyiE2uhuB4zQUIXvgVSycW7sbWLvj5TDXunEpNCRwC4kkZjK7rol
                    jtT2cbb7W2s4Bkg3R42G3PLqBvt2N32e/0JOTViCk8/iccJ4sXqrS1uUN4iB5Nmv
                    JK74csVl+0u0UecCAwEAAaOCAVowggFWMBIGA1UdEwEB/wQIMAYBAf8CAQAwDgYD
                    VR0PAQH/BAQDAgGGMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAdBgNV
                    HQ4EFgQUgbgOY4qJEhjl+js7UJWf5uWQE4UwHwYDVR0jBBgwFoAUhBjMhTTsvAyU
                    lC4IWZzHshBOCggwewYIKwYBBQUHAQEEbzBtMC8GCCsGAQUFBzABhiNodHRwOi8v
                    b2NzcC5yb290Y2ExLmFtYXpvbnRydXN0LmNvbTA6BggrBgEFBQcwAoYuaHR0cDov
                    L2NydC5yb290Y2ExLmFtYXpvbnRydXN0LmNvbS9yb290Y2ExLmNlcjA/BgNVHR8E
                    ODA2MDSgMqAwhi5odHRwOi8vY3JsLnJvb3RjYTEuYW1hem9udHJ1c3QuY29tL3Jv
                    b3RjYTEuY3JsMBMGA1UdIAQMMAowCAYGZ4EMAQIBMA0GCSqGSIb3DQEBCwUAA4IB
                    AQCtAN4CBSMuBjJitGuxlBbkEUDeK/pZwTXv4KqPK0G50fOHOQAd8j21p0cMBgbG
                    kfMHVwLU7b0XwZCav0h1ogdPMN1KakK1DT0VwA/+hFvGPJnMV1Kx2G4S1ZaSk0uU
                    5QfoiYIIano01J5k4T2HapKQmmOhS/iPtuo00wW+IMLeBuKMn3OLn005hcrOGTad
                    hcmeyfhQP7Z+iKHvyoQGi1C0ClymHETx/chhQGDyYSWqB/THwnN15AwLQo0E5V9E
                    SJlbe4mBlqeInUsNYugExNf+tOiybcrswBy8OFsd34XOW3rjSUtsuafd9AWySa3h
                    xRRrwszrzX/WWGm6wyB+f7C4
                    -----END CERTIFICATE-----
                EOT
              - is_ca                = true
              - issuer               = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - not_after            = "2030-08-23T22:21:28Z"
              - not_before           = "2022-08-23T22:21:28Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "166129328851546858514271303855646110030630415"
              - sha1_fingerprint     = "2ad974a775f73cbdbbd8f5ac3a49255fa8fb1f8c"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon RSA 2048 M01,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - cert_pem             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIF8zCCBNugAwIBAgIQCyh9/lUkkLD98KTQ/OcDtjANBgkqhkiG9w0BAQsFADA8
                    MQswCQYDVQQGEwJVUzEPMA0GA1UEChMGQW1hem9uMRwwGgYDVQQDExNBbWF6b24g
                    UlNBIDIwNDggTTAxMB4XDTIzMDQxNTAwMDAwMFoXDTI0MDUxMzIzNTk1OVowLjEs
                    MCoGA1UEAxMjb2lkYy5la3MuY2EtY2VudHJhbC0xLmFtYXpvbmF3cy5jb20wggEi
                    MA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCznmN7lVcOhBPpI8FHDwvtpQ2a
                    bTWZLlByZXtSYPVN7P9PrqJ6nf0Yids4L+Ko1kiyCOzd7XOgwE0rzGeJNrxArW7U
                    AV4CcsbooYij5470lOP2ZR16LWfpZHOZqqGAj++VX7GJ+ziknmdI5eCxup8L1By7
                    qr5s6denBJfw6G/rOqH+xajpaTXE8GzoJwQhGPWpJJogRs0hRZufGodM8FpkYF4Z
                    GXOZFYfgdYrd6g5IPwcejBpiytVXCyDaHyY1Oe7f3JJDl4jIcVrAj6TzSdXUTZQg
                    W9lMrhY9fyUR5sYvBBniHrTo4QUeEUrVqV+tsWlnLvxsmiSj9uX4/gmwzaetAgMB
                    AAGjggL9MIIC+TAfBgNVHSMEGDAWgBSBuA5jiokSGOX6OztQlZ/m5ZAThTAdBgNV
                    HQ4EFgQU6lhBDa4Biz7Ul8kznehIUWxmjpowLgYDVR0RBCcwJYIjb2lkYy5la3Mu
                    Y2EtY2VudHJhbC0xLmFtYXpvbmF3cy5jb20wDgYDVR0PAQH/BAQDAgWgMB0GA1Ud
                    JQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjA7BgNVHR8ENDAyMDCgLqAshipodHRw
                    Oi8vY3JsLnIybTAxLmFtYXpvbnRydXN0LmNvbS9yMm0wMS5jcmwwEwYDVR0gBAww
                    CjAIBgZngQwBAgEwdQYIKwYBBQUHAQEEaTBnMC0GCCsGAQUFBzABhiFodHRwOi8v
                    b2NzcC5yMm0wMS5hbWF6b250cnVzdC5jb20wNgYIKwYBBQUHMAKGKmh0dHA6Ly9j
                    cnQucjJtMDEuYW1hem9udHJ1c3QuY29tL3IybTAxLmNlcjAMBgNVHRMBAf8EAjAA
                    MIIBfwYKKwYBBAHWeQIEAgSCAW8EggFrAWkAdgB2/4g/Crb7lVHCYcz1h7o0tKTN
                    uyncaEIKn+ZnTFo6dAAAAYeCPnuiAAAEAwBHMEUCIQCo63dd2oUw0jUbNwxaGILj
                    obQhpfPfwFW5UP8kvwW25wIgQ1v3QqEZ/sCcdwfEvLfdqZ3zJlPPiuTE2MHDGyTY
                    K4QAdgBz2Z6JG0yWeKAgfUed5rLGHNBRXnEZKoxrgBB6wXdytQAAAYeCPnuyAAAE
                    AwBHMEUCIQDpPdm50DWTa7GPt78Yb/cR8cOKi8sqo5qGUlnHwW8uCAIgPa/R2Fia
                    zrBR2ZBtXBZbgQ8yG1ogkV1QOpCCNBeWegoAdwBIsONr2qZHNA/lagL6nTDrHFIB
                    y1bdLIHZu7+rOdiEcwAAAYeCPnuHAAAEAwBIMEYCIQCZxYaJkjxJWo/4xM3qZnmk
                    Bm3yeeuWgvX+z3rYpguGpAIhAIJncxSietPYtv1+TiYiDwAjOlyN6z18XzQQTnyI
                    J3YmMA0GCSqGSIb3DQEBCwUAA4IBAQCSxwjd4s4NC1lrS1P9lywfjRiASlmf5Hc2
                    mW58x1dHNdzRJDmnQV9kbsHt+hn99SsYpbWvc8FEj01CQ+0CJeRqnKRBgelzUv11
                    G4ZB2WY2AS+xqkqnwyOAbeHmN0CdczT/u+DdWGYROOdExx6NHJfTlQWrkJLyV073
                    1VK5ZHBg10usaiXSj+Tx336aohVYH8BSg5H9qWuNsMccuzAgyi7QWsrFSq0lJxIH
                    cJlTFXNOe7SXRUwd6WNTSl88pDCnayBv9eKhrUkmSzue2rWfEDUVZgCBD53aTyVN
                    S2mb1RnOsrdJYBpkHWX/HPbQqeSCoqi1wiieu7ztdjDTcXEUnd+n
                    -----END CERTIFICATE-----
                EOT
              - is_ca                = false
              - issuer               = "CN=Amazon RSA 2048 M01,O=Amazon,C=US"
              - not_after            = "2024-05-13T23:59:59Z"
              - not_before           = "2023-04-15T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "14831755279479633239047093880023876534"
              - sha1_fingerprint     = "394b2cdabaf21bd23cafa6d3b450b993ff3bbc4f"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=oidc.eks.ca-central-1.amazonaws.com"
              - version              = 3
            },
        ] -> (known after apply)
      ~ id           = "baad75ed7c378c9a948438dc8861621a893f7c82" -> (known after apply)
      - verify_chain = true -> null
        # (1 unchanged attribute hidden)
    }

  # aws_eks_addon.coredns will be updated in-place
  ~ resource "aws_eks_addon" "coredns" {
      ~ addon_version     = "v1.8.7-eksbuild.1" -> "v1.8.7-eksbuild.4"
        id                = "notification-canada-ca-staging-eks-cluster:coredns"
        tags              = {}
        # (7 unchanged attributes hidden)
    }

  # aws_eks_addon.kube_proxy will be updated in-place
  ~ resource "aws_eks_addon" "kube_proxy" {
      ~ addon_version     = "v1.22.6-eksbuild.1" -> "v1.23.16-eksbuild.2"
        id                = "notification-canada-ca-staging-eks-cluster:kube-proxy"
        tags              = {}
        # (7 unchanged attributes hidden)
    }

  # aws_eks_addon.vpc_cni will be updated in-place
  ~ resource "aws_eks_addon" "vpc_cni" {
      ~ addon_version     = "v1.11.0-eksbuild.1" -> "v1.12.6-eksbuild.2"
        id                = "notification-canada-ca-staging-eks-cluster:vpc-cni"
        tags              = {}
        # (7 unchanged attributes hidden)
    }

  # aws_eks_cluster.notification-canada-ca-eks-cluster will be updated in-place
  ~ resource "aws_eks_cluster" "notification-canada-ca-eks-cluster" {
        id                        = "notification-canada-ca-staging-eks-cluster"
        name                      = "notification-canada-ca-staging-eks-cluster"
        tags                      = {
            "CostCenter" = "notification-canada-ca-staging"
            "Name"       = "notification-canada-ca"
        }
      ~ version                   = "1.22" -> "1.23"
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group" {
        id              = "notification-canada-ca-staging-eks-cluster:notification-canada-ca-staging-eks-primary-node-group"
      ~ release_version = "1.22.17-20230217" -> "1.23.17-20230513"
        tags            = {
            "CostCenter" = "notification-canada-ca-staging"
            "Name"       = "notification-canada-ca"
        }
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_iam_openid_connect_provider.notification-canada-ca will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "notification-canada-ca" {
        id              = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
        tags            = {}
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.notification-service-account-role will be updated in-place
  ~ resource "aws_iam_role" "notification-service-account-role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub = "system:serviceaccount:notification-canada-ca:notification-service-account"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "notification-service-account-role"
        name                  = "notification-service-account-role"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
